# Analyzing the App Login Pattern of customer

In [1]:
from pymongo import MongoClient 
import pandas as pd
import sys
import numpy as np

In [6]:
import time

## Reading the data from mongodb

In [7]:
try: 
    conn = MongoClient('192.168.1.72', 27017) 
    print("Connected successfully!!!") 
except:   
    print("Could not connect to MongoDB")

Connected successfully!!!

In [8]:
#Ankit = conn.database

In [9]:
mydb = conn.SK

In [11]:
# For December 

start_time = time.clock()


collection1 = mydb.TraceLog_11012019
collection2 = mydb.TraceLog_11022019
collection3 = mydb.TraceLog_11032019
collection4 = mydb.TraceLog_11042019
collection5 = mydb.TraceLog_11052019
collection6 = mydb.TraceLog_11062019
collection7 = mydb.TraceLog_11072019
collection8 = mydb.TraceLog_11082019
collection9 = mydb.TraceLog_11092019
collection10 = mydb.TraceLog_11102019
collection11 = mydb.TraceLog_11112019
collection12 = mydb.TraceLog_11122019
collection13 = mydb.TraceLog_11132019
collection14 = mydb.TraceLog_11142019
collection15 = mydb.TraceLog_11152019
collection16 = mydb.TraceLog_11162019
collection17 = mydb.TraceLog_11172019
collection18 = mydb.TraceLog_11182019
collection19 = mydb.TraceLog_11192019
collection20 = mydb.TraceLog_11202019
collection21 = mydb.TraceLog_11212019
collection22 = mydb.TraceLog_11222019
collection23 = mydb.TraceLog_11232019
collection24 = mydb.TraceLog_11242019
collection25 = mydb.TraceLog_11252019
collection26 = mydb.TraceLog_11262019
collection27 = mydb.TraceLog_11272019
collection28 = mydb.TraceLog_11282019
collection29 = mydb.TraceLog_11292019
collection30 = mydb.TraceLog_11302019
#collection31 = mydb.TraceLog_11312019

print (time.clock() - start_time, "seconds")

0.0012651000000118984 seconds

C:\Users\Ankit\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning: time.clock has been deprecated in Python 3.3 and will be removed from Python 3.8: use time.perf_counter or time.process_time instead
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\Ankit\Anaconda3\lib\site-packages\ipykernel_launcher.py:38: DeprecationWarning: time.clock has been deprecated in Python 3.3 and will be removed from Python 3.8: use time.perf_counter or time.process_time instead

In [ ]:
start_time = time.clock()


df1 = pd.DataFrame(list(collection1.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df2 = pd.DataFrame(list(collection2.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df3 = pd.DataFrame(list(collection3.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df4 = pd.DataFrame(list(collection4.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df5 = pd.DataFrame(list(collection5.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df6 = pd.DataFrame(list(collection6.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df7 = pd.DataFrame(list(collection7.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df8 = pd.DataFrame(list(collection8.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df9 = pd.DataFrame(list(collection9.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df10 = pd.DataFrame(list(collection10.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df11 = pd.DataFrame(list(collection11.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df12 = pd.DataFrame(list(collection12.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df13 = pd.DataFrame(list(collection13.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df14 = pd.DataFrame(list(collection14.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df15 = pd.DataFrame(list(collection15.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df16 = pd.DataFrame(list(collection16.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df17 = pd.DataFrame(list(collection17.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df18 = pd.DataFrame(list(collection18.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df19 = pd.DataFrame(list(collection19.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df20 = pd.DataFrame(list(collection20.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df21 = pd.DataFrame(list(collection21.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df22 = pd.DataFrame(list(collection22.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df23 = pd.DataFrame(list(collection23.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df24 = pd.DataFrame(list(collection24.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df25 = pd.DataFrame(list(collection25.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df26 = pd.DataFrame(list(collection26.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df27 = pd.DataFrame(list(collection27.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df28 = pd.DataFrame(list(collection28.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df29 = pd.DataFrame(list(collection29.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
df30 = pd.DataFrame(list(collection30.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
#df31 = pd.DataFrame(list(collection31.find({},{"UserName":1,"CreatedDate":1,"_id":0})))


# df1 = pd.DataFrame(list(collection.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
# df1 = pd.DataFrame(list(collection.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
# df1 = pd.DataFrame(list(collection.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
# df1 = pd.DataFrame(list(collection.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
# df1 = pd.DataFrame(list(collection.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
# df1 = pd.DataFrame(list(collection.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
# df1 = pd.DataFrame(list(collection.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
# df1 = pd.DataFrame(list(collection.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
# df1 = pd.DataFrame(list(collection.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
# df1 = pd.DataFrame(list(collection.find({},{"UserName":1,"CreatedDate":1,"_id":0})))
# df1 = pd.DataFrame(list(collection.find({},{"UserName":1,"CreatedDate":1,"_id":0})))

print (time.clock() - start_time, "seconds")

C:\Users\Ankit\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: time.clock has been deprecated in Python 3.3 and will be removed from Python 3.8: use time.perf_counter or time.process_time instead
  """Entry point for launching an IPython kernel.

In [ ]:
frames = [df1,df2,df3,df4,df5,df6,df7,df8,df9,df10,df11,df12,df13,df14,df15,df16,df17,df18,df19,df20,df21,df22,df23,df24,df25,df26,df27,df28,df29,df30]
df = pd.concat(frames)

In [ ]:
df.to_csv('Dataset1.csv')

In [ ]:
#df_csv = pd.read_csv('Dataset1.csv')

##  Data Processing and data cleaning

In [11]:
#df = pd.read_csv('Dataset1.csv')

In [12]:
df.replace('', np.nan, inplace=True)

In [13]:
df

                           UserName             CreatedDate
0        8871888734-piyush jaishwal 2019-11-30 18:30:00.429
1                        8218816084 2019-11-30 18:30:01.077
2          9424445828-Narendra Sahu 2019-11-30 18:30:01.082
3                        8218816084 2019-11-30 18:30:01.087
4                        8218816084 2019-11-30 18:30:01.119
...                             ...                     ...
1177245                  7869451730 2019-12-31 18:29:57.774
1177246            8077510191_41083 2019-12-31 18:29:58.380
1177247            8077510191_41083 2019-12-31 18:29:58.387
1177248            8077510191_41083 2019-12-31 18:29:58.393
1177249            8077510191_41083 2019-12-31 18:29:58.524

[30351879 rows x 2 columns]

In [14]:
df1 = df.dropna().copy()

In [15]:
df1

                           UserName             CreatedDate
0        8871888734-piyush jaishwal 2019-11-30 18:30:00.429
1                        8218816084 2019-11-30 18:30:01.077
2          9424445828-Narendra Sahu 2019-11-30 18:30:01.082
3                        8218816084 2019-11-30 18:30:01.087
4                        8218816084 2019-11-30 18:30:01.119
...                             ...                     ...
1177245                  7869451730 2019-12-31 18:29:57.774
1177246            8077510191_41083 2019-12-31 18:29:58.380
1177247            8077510191_41083 2019-12-31 18:29:58.387
1177248            8077510191_41083 2019-12-31 18:29:58.393
1177249            8077510191_41083 2019-12-31 18:29:58.524

[29358543 rows x 2 columns]

In [16]:
df1["new_date"] = [d.date() for d in df1['CreatedDate']]
df1["new_time"] = [d.time() for d in df1['CreatedDate']]

In [17]:
df1['new_date'].apply(pd.to_datetime)

0         2019-11-30
1         2019-11-30
2         2019-11-30
3         2019-11-30
4         2019-11-30
             ...
1177245   2019-12-31
1177246   2019-12-31
1177247   2019-12-31
1177248   2019-12-31
1177249   2019-12-31
Name: new_date, Length: 29358543, dtype: datetime64[ns]

In [18]:
df1.to_csv('Dataset2.csv')

In [19]:
#df1 = pd.read_csv('Dataset2.csv')

In [20]:
df1

,UserName,CreatedDate,new_date,new_time
0,8871888734-piyush jaishwal,2019-11-30 18:30:00.429,2019-11-30,18:30:00.429000
1,8218816084,2019-11-30 18:30:01.077,2019-11-30,18:30:01.077000
2,9424445828-Narendra Sahu,2019-11-30 18:30:01.082,2019-11-30,18:30:01.082000
3,8218816084,2019-11-30 18:30:01.087,2019-11-30,18:30:01.087000
4,8218816084,2019-11-30 18:30:01.119,2019-11-30,18:30:01.119000
...,...,...,...,...
1177245,7869451730,2019-12-31 18:29:57.774,2019-12-31,18:29:57.774000
1177246,8077510191_41083,2019-12-31 18:29:58.380,2019-12-31,18:29:58.380000
1177247,8077510191_41083,2019-12-31 18:29:58.387,2019-12-31,18:29:58.387000
1177248,8077510191_41083,2019-12-31 18:29:58.393,2019-12-31,18:29:58.393000
1177249,8077510191_41083,2019-12-31 18:29:58.524,2019-12-31,18:29:58.524000

In [21]:
a=df1.groupby('UserName')['new_date'].apply(set)
b = a.to_frame()
c = b.copy()

In [22]:
c.to_csv('Dataset3.csv')

In [23]:
c

                                                                       new_date
UserName
-                             {2019-12-22, 2019-12-21, 2019-12-28, 2019-12-1...
-Bheru Bhai                                                        {2019-12-14}
1111122222                    {2019-12-25, 2019-12-26, 2019-12-17, 2019-12-0...
2222233333-Agentqa test                                            {2019-12-27}
6000614093_0                                                       {2019-12-28}
...                                                                         ...
twh@shopKirana.com                                     {2019-12-04, 2019-12-05}
vijay2141                     {2019-12-28, 2019-12-17, 2019-12-02, 2019-12-0...
vipin                         {2019-12-22, 2019-12-21, 2019-12-28, 2019-12-1...
vishal@shopkirana.com         {2019-12-29, 2019-12-22, 2019-12-21, 2019-12-2...
vishnu.gautam@shopKirana.com  {2019-12-21, 2019-12-28, 2019-12-17, 2019-12-0...

[23982 rows x 1 columns]

In [24]:
c['avg'] = c.apply(lambda _: '', axis=1)
c = c.reset_index()

In [25]:
#a=df1.groupby('UserName')['new_date'].apply(set)
c.head()

,UserName,new_date,avg
0,-,"{2019-12-22, 2019-12-21, 2019-12-28, 2019-12-1...",
1,-Bheru Bhai,{2019-12-14},
2,1111122222,"{2019-12-25, 2019-12-26, 2019-12-17, 2019-12-0...",
3,2222233333-Agentqa test,{2019-12-27},
4,6000614093_0,{2019-12-28},

In [26]:
c['date'] = [list(d) for d in c['new_date']]

In [27]:
c

,UserName,new_date,avg,date
0,-,"{2019-12-22, 2019-12-21, 2019-12-28, 2019-12-1...",,"[2019-12-22, 2019-12-21, 2019-12-28, 2019-12-1..."
1,-Bheru Bhai,{2019-12-14},,[2019-12-14]
2,1111122222,"{2019-12-25, 2019-12-26, 2019-12-17, 2019-12-0...",,"[2019-12-25, 2019-12-26, 2019-12-17, 2019-12-0..."
3,2222233333-Agentqa test,{2019-12-27},,[2019-12-27]
4,6000614093_0,{2019-12-28},,[2019-12-28]
...,...,...,...,...
23977,twh@shopKirana.com,"{2019-12-04, 2019-12-05}",,"[2019-12-04, 2019-12-05]"
23978,vijay2141,"{2019-12-28, 2019-12-17, 2019-12-02, 2019-12-0...",,"[2019-12-28, 2019-12-17, 2019-12-02, 2019-12-0..."
23979,vipin,"{2019-12-22, 2019-12-21, 2019-12-28, 2019-12-1...",,"[2019-12-22, 2019-12-21, 2019-12-28, 2019-12-1..."
23980,vishal@shopkirana.com,"{2019-12-29, 2019-12-22, 2019-12-21, 2019-12-2...",,"[2019-12-29, 2019-12-22, 2019-12-21, 2019-12-2..."
23981,vishnu.gautam@shopKirana.com,"{2019-12-21, 2019-12-28, 2019-12-17, 2019-12-0...",,"[2019-12-21, 2019-12-28, 2019-12-17, 2019-12-0..."

In [28]:
#c['date1'] = [d.sort() for d in c['date']]

In [29]:
c.iloc[19758][1]

{datetime.date(2019, 12, 30)}

## Finding intervals at which the customer login

In [31]:
for i in range(len(c)) :
    l = (c.iloc[i, 3]) 
    for j in range(len(l)-1):
        tstamp1 = l[j]
        tstamp2 = l[j+1]
        if tstamp1 > tstamp2:
            td = tstamp1 - tstamp2
        else:
            td = tstamp2 - tstamp1
        l[j] = td.days
    l1 = l[0:len(l)-1]
    if (len(l1)!=0):
        avg = sum(l1)/(len(l1))
        c.iloc[i,2] = avg
    else :
        c.iloc[i,2] = 0

In [32]:
c

,UserName,new_date,avg,date
0,-,"{2019-12-22, 2019-12-21, 2019-12-28, 2019-12-1...",9.6129,"[1, 7, 11, 15, 28, 21, 2, 7, 14, 8, 17, 1, 7, ..."
1,-Bheru Bhai,{2019-12-14},0,[2019-12-14]
2,1111122222,"{2019-12-25, 2019-12-26, 2019-12-17, 2019-12-0...",10.875,"[1, 9, 15, 3, 22, 23, 1, 13, 2019-12-16]"
3,2222233333-Agentqa test,{2019-12-27},0,[2019-12-27]
4,6000614093_0,{2019-12-28},0,[2019-12-28]
...,...,...,...,...
23977,twh@shopKirana.com,"{2019-12-04, 2019-12-05}",1,"[1, 2019-12-05]"
23978,vijay2141,"{2019-12-28, 2019-12-17, 2019-12-02, 2019-12-0...",9.2,"[11, 15, 7, 2, 7, 8, 17, 1, 7, 28, 15, 1, 4, 1..."
23979,vipin,"{2019-12-22, 2019-12-21, 2019-12-28, 2019-12-1...",10.4,"[1, 7, 11, 15, 28, 21, 5, 9, 1, 7, 28, 15, 1, ..."
23980,vishal@shopkirana.com,"{2019-12-29, 2019-12-22, 2019-12-21, 2019-12-2...",4.90909,"[7, 1, 4, 3, 4, 7, 13, 1, 11, 2, 1, 2019-12-19]"
23981,vishnu.gautam@shopKirana.com,"{2019-12-21, 2019-12-28, 2019-12-17, 2019-12-0...",10.037,"[7, 11, 15, 28, 21, 2, 7, 8, 17, 1, 7, 4, 24, ..."

In [33]:
c.to_csv('Dataset_with date set.csv')

In [34]:
c.to_excel('Dataset_with date set.xlsx')

In [35]:
c1 = c[['UserName','avg']]

In [36]:
c1

                           UserName      avg
0                                 -   9.6129
1                       -Bheru Bhai        0
2                        1111122222   10.875
3           2222233333-Agentqa test        0
4                      6000614093_0        0
...                             ...      ...
23977            twh@shopKirana.com        1
23978                     vijay2141      9.2
23979                         vipin     10.4
23980         vishal@shopkirana.com  4.90909
23981  vishnu.gautam@shopKirana.com   10.037

[23982 rows x 2 columns]

In [37]:
c2 = c1.sort_values('avg',ascending=False)

In [38]:
c3 = c1.sort_values('avg',ascending=True)

In [39]:
c3.to_csv('Dataset4_ascending.csv')

In [40]:
c3.to_excel('Dataset4_ascending.xlsx')

In [41]:
c2.to_csv('Dataset4.csv')

In [42]:
c2.to_excel("Dataset4.xlsx")

In [ ]:
# Insert Data 
# rec_id1 = collection.insert_one(emp_rec1) 
# rec_id2 = collection.insert_one(emp_rec2)

In [ ]:
# print("Data inserted with record ids",rec_id1," ",rec_id2)

In [ ]:
# Printing the data inserted 
# cursor = collection.find() 
# for record in cursor: 
#    print(record)